{
  "title": "Knowledge, Righteousness and Good Manners",
  "pages": [
    "Page 1 - Author's Biography in Brief, His Lineage, His name is Yahya Ibn Sharfuddeen Muree Ibn Hassan Al-Hizaammee Al-Huraanee, he was also known as Abu Zakariyyah; however he did not have a son named Zakariyyah as he did not marry. He Was given the nickname Muhyee-ud Deen (Reviver of the Religion); nevertheless he used to despise this title, and disliked being called that out of humbleness to Allah. One of the reasons why he disliked it was because Allah's religion is continuous and need of no one but Allah to keep it alive and established. It has been said that Imam An-Nawawi once said 'I shall not forgive the one who gives me this title Muhyee-ud Deen (Reviver of the Religion).' In another report it is stated that he",
    "Page 2 - 'It is impermissible for someone to nickname me Muhyee ul-Deen.' His Place of Birth: He was born in Nawa, the capital of Julaan, in the land of Huraan, in the year 631H in the month of Muharram. It is said that he was given the name Al-Nawawi by virtue of his place of birth, Nawa, and his place of residence was Damascus, Syria. His Early Life: He memorized the Quran before puberty, abandoning distractions and play. His burning thirst for knowledge could not be quenched in Nawa, so his father took him, at the age of 19, to seek knowledge in Damascus, where he enrolled at the school of Rawaahiyyah in the year 649H. During this time, in just four and a half months, he memorized the book At-Tanbeeh authored by Abu Ishaaq Al-Sheeraazee. In addition, he memorized a quarter of Al-Ibaadaat from the book Al-Muhadhab Fee Furoo during the remainder of that year. He would study 12 lessons a day, revising them on his way to classes and on his way home. It was said that not a moment of his life was wasted, except in the pursuit of Ilm (knowledge). His Later Life: He taught in many institutes, including Al-Madrasah Al-Iqbaaliyah, Al-Fulkeeyah, and Rukuneeyah. He was also appointed as a senior instructor in the institute Daarul Hadith Al-...",
    "Page 3 - Ashraaqeeyah after Abu Shaamah Abdir Rahmaan passed away in the year 665H and continued till his own death in year 676H. HIS SHUYOOKH: Imam An-Nawawi had many Shuyookh (pi. Shaykh), too many to mention but his main and primary teacher was Shaykh Ishaaq Ibn Ahmad Ibn Uthmaan Al-Magribi Al-Maqdisi. HIS STUDENTS: Some say it was over one hundred students. HIS WRITINGS: Imam An-Nawawi authored many works; we will mention just a few: • Forty Ahaadith • Sharh Sahih Muslim • Sharh Sahihul Bukhari • Sharh Sunnan Abee Dawood • Irshaad • Al-Majmoo Sharh Al-Muhadhdhab • Raudhatut Taalibeen • Minhaajal Taalibeen • Tibyaan Fee Aadaab Hamlatil Quran • Bustaan Al-Aarifeen • Al-Adhkaar. For further reference on the names of Imam An-Nawawi’s Shuyookh see Al-Bidaayah wa Nihaayah by Ibn Kathir, 13/278.",
    "Page 4 - SCHOLARS WHO WROTE BIOGRAPHIES ABOUT HIM: From the Ulama (Scholars) who wrote a biography about him, we will mention just a few: • Al-Minhaajul Sawee fee Tarjamah Al-Imam An-Nawawi • Tuhfatul Taalibeen Fee Tarjamah Al-Muhyyee ul-Deen • Munhal Al-Adhab Al-Rawee Fee Tarjamah Al-Imam An-Nawawi • Tabaqaat As-Shaafi’eeyah Al-Kubrah. HIS DEATH: The great Imam traveled to Jerusalem after remaining in Damascus for almost 29 years, after which he returned to his hometown, Nawa, where he became very ill in the house of his father who was looking after him. It was here that the Imam passed away in the year 676H in the month of Rajab. And this is where he was buried.",
    "Page 5 - SHAYKH IBN UTHAYMEEN’S BIOGRAPHY IN BRIEF HIS LINEAGE: He is Abu Abdullah Muhammad Ibn Saalih Ibn Muhammad Ibn Uthaymeen Al-Wuhaybee at-Tameemee. HIS PLACE OF BIRTH: He was born in the city of Unaynah in the region of Qaseem in Saudi Arabia on the 27th of the month of Ramadan, 1347H, which corresponds to around 1926. HIS EARLY LIFE: He would recite the Quran with his maternal grandfather, Abdur Rahmaan Ibn Suleiman Al-Daamigh. He then memorized the whole Quran and took a path in pursuing knowledge. He learned how to write Arabic, arithmetic and...",
    "Page 6 - The Noble Shaykh, Abdur Rahmaan As-Sa’dee’s two students, Shaykh Ali As-Saalihee and Shaykh Muhammad Ibn Abdul-Azeez Al-Mutawwi, took up the task of teaching the young children. Shaykh Muhammad Ibn Abdul-Azeez taught Shaykh Ibn Uthaymeen the abridgement of Ibn Taymiyyah’s Aqeedatul Waasitiyah, written by Shaykh As-Sa’dee, and Minhaajus Saalikeen fi Fiqh by Shaykh As-Sa’dee; he also studied Al-Aajurrumiyyah and Al-Alfiyyah. Under Shaykh Abdur Rahmaan Ibn Ali Awdaan, he studied the laws of inheritance and Fiqh, and from these who were considered his first Shaykh was Shaykh As-Sa’dee, who he stayed with for a period of time and studied with him Tawheed, Fiqh, Usoolul Fiqh, Faraa’id, Usoolul Hadith, Nahoo, Sarf, Hadith and Tafsir. He also studied under His Eminence Shaykh Ibn Baz who was his second Shaykh, and with whom he studied Al-Bukhari and some of the works of Ibn Taymiyyah and some books of Fiqh. HIS LATER LIFE: In the year 1371H Ibn Uthaymeen began to teach in the Masjid, and when an institute opened in Riyadh he enrolled in 1372 and two years later he graduated and was given a position as a teacher at the institute in Unayzah. He continued his studies with the College of Sharia and Shaykh As-Sa’dee until his death. Ibn Uthaymeen replaced As-Sa’dee in the main Masjid in Unayzah where he served as Imam and Khateeb. Ibn Uthaymeen also taught at the library in Unayzah as well as the Department of Sharia and Theology...",
    "Page 7 - in the Qaseem branch of Muhammad Ibn Su’ood Islamic University. The Shaykh was also a member of the senior council of eminent Scholars of Saudi Arabia. It is worth mentioning that the late Mufti Muhammad Ibn Ibraheem offered him to take the position of a judge many times, but the Shaykh excused himself. HIS SHUYOOKH: • Shaykh Muhammad Al-Ameen Ibn Muhammad Al-Muktaar Al-Juknee Al-Shanqeeti. • Shaykh Ali Ibn Hamid Al-Saalihee as well as those already mentioned. HIS STUDENTS: It is reported that there were too many to count, some say over five hundred. HIS WRITINGS: It has been mentioned that his works exceed 80 in number and they mostly consist of small treatises. HIS DEATH: The Shaykh passed away on Wednesday, the 15th of Shawwaal, 1421, corresponding to January 10th, 2001, at the age seventy-four years of age.",
    "Page 8 - THE CHAPTER ON KNOWLEDGE.",
    "Page 9 - TRANSLATOR’S PREFACE Verily all praises are due to Allah. We praise Him and seek His help and forgiveness. We seek refuge with Allah from our evil souls and our wrongdoings. He whom Allah guides, no one can misguide, and he whom He misguides, no one can guide. I bear witness that there is no true god except Allah alone without any partners. And I bear witness that Muhammad is His Abd (servant) and Messenger. 'O you who believe! Fear Allah as He should be feared and die not except in a state of submission.' (Aali Imraan, 102).",
    "Page 10 - …mate, and from them both He created many men and women; and fear Allah through Whom you demand your mutual rights and do not sever the relations of the wombs (Kinship). Indeed, Allah is Ever an All-Watcher over you.' (An-Nisaa, 1), 'O you who believe! Fear Allah and say just words. He will direct you to do good deeds and forgive you your sins. He who obeys Allah and His Messenger has certainly achieved a great victory.' (Al-Ahzaab, 70-71). Verily, the best speech is Allah's Speech and the best of guidance is Muhammad’s guidance, and the worst matters (in creed or worship) are those innovated (by the people), for every innovated matter is a Bidah (prohibited innovation), and every Bidah is an act of misguidance that (whoever initiated it) will reside in the Fire. It gives me great honour to be able to translate this chapter, the Chapter of Knowledge from one of Imam An-Nawawi’s most famous books, Riyaadus Saliheen, along with...",
    "Page 11 - the explanation of the esteemed Scholar Shaykh Ibn Uthaymeen. Imam An-Nawawi’s purpose for writing such an outstanding book was to encourage others to do good. So for this reason, I have specifically chosen this chapter regarding 'Ilm' (knowledge), in the hope of encouraging my brothers and sisters wherever they may be and in whatever circumstances they find themselves in, to not give up the pursuit of seeking 'Ilm'. Especially in the time we are living in whereby the desire for seeking 'Ilm' has, with deep regret, decreased greatly. So I hope that translating Shaykh Ibn Uthaymeen’s explanation of the chapter of 'Ilm', will re-light the flame that many of us once had burning in us and awaken us from our prolonged sleeplessness and prevent us from wasting our time and spend more of it seeking knowledge as well as practicing it, as the Salaf used to say: 'Knowledge calls for action, so either the call is answered or it will take off.' So we must return to seeking knowledge if we are not already doing that and remember its great virtues, for by not doing so we are preventing ourselves from much good; and the proof for my claim is as Al-Hasan Al-Basri said: 'Ilm (knowledge) is more specific than (merely) knowing things - what is intended by this, in the Sharia, is knowledge of the Quran which was revealed to the Prophet.' Al-Bayhaqee said: 'The meaning of Ilm is knowledge of the Quran and the Sunnah, and the statements of the Companions and their followers and what they were upon.'",
    "Page 12 - 'That I learn one chapter pertaining to Ilm, then teach it to a Muslim, is better to me than having the whole world and spending it in Allah's cause.' Regarding the great virtue of seeking Ilm is the statement of Ibn Abdullah: 'Ilm (knowledge) is better and more virtuous than worship! For the one who acts according to his Ilm, will be a worshipper to the Creator, while the one who acts only with worship and no knowledge will be deluded into thinking that he is worshipping, when in reality he is not.'",
    "Page 13 - The Knowledge that is being referred to in this chapter is of the highest rank of knowledge, which is beneficial knowledge, for it is Allah’s revelation or that which supports it, which is the Sunnah. And that which opposes Allah’s revelation is not knowledge but ignorance. For knowledge is guidance and understanding; it leads the soul to do that which is beneficial, and helps it to avoid what is harmful. The messenger (peace and blessings of Allah be upon him) was sent to us to teach us this beneficial knowledge. Imam An-Nawawi said: 'The noble person is one who takes great care of knowledge and does not waste it, as he would not waste his life.' The knowledge that is mentioned here in this chapter, which we call 'Ilm', is a deep and broad understanding of the religion of Islam. May Allah make us from those who benefit from the knowledge that has been revealed and from those who act upon it. May He grant us the success to know what is beneficial and to avoid that which leads us astray.",
    "Page 14 - The importance of seeking knowledge in Islam cannot be overstated. The Qur’an is full of verses which exhort believers to seek knowledge, as in the verse where Allah (subhanahu wa ta'ala) says: 'Are those who know equal to those who do not know?' (Az-Zumar, 9) This question is rhetorical and requires an answer of course: they are not equal, and so seeking knowledge is an act of excellence. Likewise, the Messenger of Allah (peace be upon him) said, 'Seeking knowledge is an obligation upon every Muslim.' (Ibn Majah) Furthermore, the knowledge that is being referred to here is the knowledge that guides one to the truth, which will lead to eternal success in the Hereafter. Hence, when we speak of the pursuit of knowledge, it should always be in connection to seeking Allah’s pleasure and striving to make our actions conform to what He has legislated.",
    "Page 15 - The reward for seeking knowledge and spreading it is immense. Allah’s Messenger (peace be upon him) said: 'Whoever Allah wishes good for, He gives him understanding of the religion.' (Bukhari and Muslim) This understanding refers to both knowledge and wisdom in practicing that knowledge. For knowledge without application is like a tree without fruit, and this knowledge is meant to be spread by the scholars who, as the Messenger of Allah (peace be upon him) stated, 'are the inheritors of the prophets.' The more one seeks knowledge, the more they will be in line with the guidance that the Messenger of Allah (peace be upon him) provided to us, and the more successful they will be in attaining true happiness.",
    "Page 16 - Knowledge is not just about accumulating information, but it is about understanding the purpose behind it, and applying it to benefit oneself and others. Imam An-Nawawi emphasized this understanding in his writings, as he illustrated that knowledge should be applied to our actions, words, and interactions with others. The Prophet Muhammad (peace be upon him) exemplified this approach, teaching through both his words and deeds. It is only when knowledge is truly implemented in life that it becomes a tool for transformation, both individually and communally.",
    "Page 17 - In conclusion, the pursuit of knowledge in Islam is one of the highest acts of worship. It leads to a deeper understanding of our Creator, His Messenger, and the way to live our lives in accordance with their guidance. It is the light that illuminates the path to righteousness, and it is the foundation upon which good manners and a righteous character are built. The scholars, through their wisdom and dedication to spreading knowledge, continue to play an essential role in guiding the Muslim Ummah, and their contributions should be revered and followed by all who seek the truth."
  ]
}
