{
  "title": "Knowledge, Righteouness and Good Manners",
  "pages": [
    "Page 1 - Author's Biography in Breif, His Lineage, His name is Yahya Ibn Sharfuddeen Muree Ibn Hassan Al-Hizaammee Al-Huraanee, he was also known as Abu Zakariyyah; however he did not have a son named Zakariyyah as he did not marry. He Was given the nickname Muhyee-ud Deen (Reviver of the Religion); never the less he used to despise this title, and disliked being called that out of humbleness to Allah. One of the reasons why he disliked it was becasue Allah's religion is continuous and need of no one but Allah to keep it alive and established. It has been said that Imam An-Nawawai once said 'I shall not forgive the one who gives me this title Muhyee-ud Deen(Reviver of the Religion).' In another report it is stated that he",
    "Page 2 - 'It is impermissible for someone to nickname me Muhyee ul-Deen.' His Place of Birth: He was born in Nawa, the capital of Julaan, in the land of Huraan, in the year 631H in the month of Muharram. It is said that he was given the name Al-Nawawi by virtue of his place of birth, Nawa, and his place of residence was Damascus, Syria. His Early Life: He memorized the Quran before puberty, abandoning distractions and play. His burning thirst for knowledge could not be quenched in Nawa, so his father took him, at the age of 19, to seek knowledge in Damascus, where he enrolled at the school of Rawaahiyyah in the year 649H. During this time, in just four and a half months, he memorized the book At-Tanbeeh authored by Abu Ishaaq Al-Sheeraazee. In addition, he memorized a quarter of Al-Ibaadaat from the book Al-Muhadhab Fee Furoo during the remainder of that year. He would study 12 lessons a day, revising them on his way to classes and on his way home. It was said that not a moment of his life was wasted, except in the pursuit of Ilm (knowledge).His Later Life:He taught in many institutes, including Al-Madrasah Al-Iqbaaliyah, Al-Fulkeeyah, and Rukuneeyah. He was also appointed as a senior instructor in the institute Daarul Hadith Al-...",
    "Page 3 - Ashraaqeeyah after Abu Shaamah Abdir Rahmaan passed away in the year 665H and continued till his own death in year 676H HIS SHUYOOKH: Imam An-Nawawi had many Sbuyookh (pi. Shaykh), too many to mention but his main and primary teacher was Shaykh Ishaaq Ibn Ahmad Ibn Uthmaan Al-Magribi Al-Maqdisi.2 HIS STUDENTS: Some say it was over one hundred students. HIS WRITINGS: Imam An-Nawawi authored many works; we will mention just a few: • Forty Ahaadith • Sharh Sahih Muslim • Sharh Sahihul Bukhari • Sharh Sunnan Abee Dawood • Irshaad • Al-Majmoo Sharh Al-Muhadhdhab • Raudhatut Taalibeen • Minhaajal Taalibeen • Tibyaan Fee Aadaab Hamlatil Quran • Bustaan Al-Aarifeen • Al-Adhkaar 2 For further reference on the names of Imam An-Nawawi’s Shuyookh see Al-Bidaayah wa Nihaayah by Ibn Kathir, 13/278.",
    "Page 4 - SCHOLARS WHO WROTE BIOGRAPHIES ABOUT HIM: From the Ulama (Scholars) who wrote a biography about him, we will mention just a few: • Al-Minhaajul Sawee fee Tarjamah Al-Imam An-Nawawi.3 • Tuhfatul Taalibeen Fee Tarjamah Al-Muhyyee ul-Deen • Munhal Al-Adhab Al-Rawee Fee Tarjamah Al-Imam An-Nawawi • Tabaqaat As-Shaafi’eeyah Al-Kubrah.6 HIS DEATH: The great Imam traveled to Jerusalem after remaining in Damascus for almost 29 years, after which he returned to his hometown, Nawa, where he became very ill in the house of his father who was looking after him. It was here that the Imam passed away in the year 676H in the month of Rajab. And this is where he was buried.",
    "Page 5 - SHAYKH IBN UTHAYMEEN’S BIOGRAPHY IN BRIEF HIS LINEAGE: He is Abu Abdullah Muhammad Ibn Saalih Ibn Muhammad Ibn Uthaymeen Al-Wuhaybee at-Tameemee. HIS PLACE OF BIRTH: He was born in the city of Unaynah in the region of Qaseem in Saudi Arabia on the 27th of the month of Ramadan, 1347H, which corresponds to around 1926. HIS EARLY LIFE: He would recite the Quran with his maternal grandfather, Abdur Rahmaan Ibn Suleiman Al-Daamigh. He then memorized the whole Quran and took a path in pursuing knowledge. He learned how to write Arabic, arithmetic and…",
    "Page 6 - The Noble Shaykh, Abdur Rahmaan As-Sa’dee’s two students, Shaykh Ali As-Saalihee and Shaykh Muhammad Ibn Abdul-Azeez Al-Mutawwi, took up the task of teaching the young children. Shaykh Muhammad Ibn Abdul-Azeez taught Shaykh Ibn Uthaymeen the abridgement of Ibn Taymiyyah’s Aqeedatul Waasitiyah, written by Shaykh As-Sa’dee, and Minhaajus Saalikeen fi Fiqh by Shaykh As-Sa’dee; he also studied Al-Aajurrumiyyah and Al-Alfiyyah. Under Shaykh Abdur Rahmaan Ibn Ali Awdaan, he studied the laws of inheritance and Fiqh, and from these who were considered his first Shaykh was Shaykh As-Sa’dee, who he stayed with for a period of time and studied with him Tawheed, Fiqh, Usoolul Fiqh, Faraa’id, Usoolul Hadith, Nahoo, Sarf, Hadith and Tafsir. He also studied under His Eminence Shaykh Ibn Baz who was his second Shaykh, and with whom he studied Al-Bukhari and some of the works of Ibn Taymiyyah and some books of Fiqh. HIS LATER LIFE: In the year 1371H Ibn Uthaymeen began to teach in the Masjid, and when an institute opened in Riyadh he unrolled in 1372 and two years later he graduated and was given a position as a teacher at the institute in Unayzah. He continued his studies with the College of Sharia and Shaykh As-Sa’dee until his death. Ibn Uthaymeen replaced As-Sa’dee in the main Masjid in Unayzah where he served as Imam and Khateeb. Ibn Uthaymeen also taught at the library in Unayzah as well as the Department of Sharia and Theology…",
    "Page 7 - in the Qaseem branch of Muhammad Ibn Su’ood Islamic University. The Shaykh was also a member of the senior council of eminent Scholars of Saudi Arabia. It is worth mentioning that the late Mufti Muhammad Ibn Ibraheem offered him to take the position of a judge many times, but the Shaykh excused himself HIS SHUYOOKH: • Shaykh Muhammad Al-Ameen Ibn Muhammad Al-Muktaar Al-Juknee Al-Shanqeeti. • Shaykh Ali Ibn Hamid Al-Saalihee as well as those already mentioned. HIS STUDENTS: It is reported that there were too many to count, some say over five hundred. HIS WRITINGS: It has been mentioned that his works exceed 80 in number and they mostly consist of small treatises. HIS DEATH: The Shaykh passed away on Wednesday, the 15th of Shawwaal, 1421, corresponding to January 10th, 2001, at the age seventy-four years of age.",
    "Page 8 - THE CHAPTER ON KNOWLEDGE.",
    "Page 9 - TRANSLATOR’S PREFACE Verily all praises are due to Allah. We praise Him and seek His help and forgiveness. We seek refuge with Allah from our evil souls and our wrongdoings. He whom Allah guides, no one can misguide, and he whom He misguides, no one can guide. I bear witness that there is no true god except Allah alone without any partners. And I bear witness that Muhammad is His Abd (servant) and Messenger. 'O you who believe! Fear Allah as He should be feared and die not except in a state of submission.' (Aali Imraan, 102).",
    "Page 10 - …mate, and from them both He created many men and women; and fear Allah through Whom you demand your mutual rights and do not sever the relations of the wombs (Kinship). Indeed, Allah is Ever an All-Watcher over you.' (An-Nisaa, 1), 'O you who believe! Fear Allah and say just words. He will direct you to do good deeds and forgive you your sins. He who obeys Allah and His Messenger has certainly achieved a great victory.' (Al-Ahzaab, 70-71). Verily, the best speech is Allah's Speech and the best of guidance is Muhammad’s guidance, and the worst matters (in creed or worship) are those innovated (by the people), for every innovated matter is a Bidah (prohibited innovation), and every Bidah is an act of misguidance that (whoever initiated it) will reside in the Fire. It gives me great honour to be able to translate this chapter, the Chapter of Knowledge from one of Imam An-Nawawi’s most famous books, Riyaadus Saliheen, along with…",

"Page 11 - the explanation of the esteemed Scholar Shaykh Ibn Uthaymeen. Imam An-Nawawi’s purpose for writing such an outstanding book was to encourage others to do good. So for this reason, I have specifically chosen this chapter regarding 'Ilm' (knowledge), in the hope of encouraging my brothers and sisters wherever they may be and in whatever circumstances they find themselves in, to not give up the pursuit of seeking 'Ilm'. Especially in the time we are living in whereby the desire for seeking 'Ilm' has, with deep regret, decreased greatly. So I hope that translating Shaykh Ibn Uthaymeen’s explanation of the chapter of 'Ilm', will re-light the flame that many of us once had burning in us and awaken us from our prolonged sleeplessness and prevent us from wasting our time and spend more of it seeking knowledge as well as practicing it, as the Salaf used to say: 'Knowledge calls for action, so either the call is answered or it will take off.' So we must return to seeking knowledge if we are not already doing that and remember its great virtues, for by not doing so we are preventing ourselves from much good; and the proof for my claim is as Al-Hasan Al-Basri said: 'Ilm (knowledge) is more specific than (merely) knowing things - what is intended by this, in the Sharia, is knowledge of the Quran which was revealed to the Prophet.' Al-Bayhaqee said: 'The meaning of Ilm is knowledge of the Quran and the Sunnah, and the statements of the Companions and their followers and what they were upon.'",

"Page 12 - 'That I learn one chapter pertaining to Ilm, then teach it to a Muslim, is better to me than having the whole world and spending it in Allah's cause.' Regarding the great virtue of seeking Ilm is the statement of Ibn Abdullah: 'Ilm (knowledge) is better and more virtuous than worship! Do you not see the monks who devote their whole night to pray, then sleep, but wake up only to associate partners with Allah?' Also the Prophets said: 'The excellence of knowledge is greater than optional actions and the best of your religion is piety.' So brothers and sisters this is the way of our Salaf. Ilm meant a lot to them and seeking it, and they considered it the best way to gain closeness to Allah and this is backed by the statement of Az-Zuhri who said: 'Allah is not worshipped with anything better than with Ilm.' So the Salafs methodology should strictly be followed regarding worshipping Allah, as their way has the stamp of approval. Sufyaan Ath-Thawree said:…",

"Page 13 - 'No act of worship is greater than seeking Ilm, if one's intentions are correct.' Also Ibnul Mubarak said: 'I know of nothing greater than seeking Ilm for the one who intends Allah.' It was once asked to Ibnul Mubarak: 'If you knew you had one day left to live what would you spend that last day doing?' He replied: 'I would spend it (that last day) teaching the people.' So in short, know, may Allah have mercy upon you! Take to the path of seeking Ilm, as this is something we lack greatly. Imam Ash-Shaafi said: 'Seeking Ilm is better than any optional prayers.' And as it was said by a poet: 'So know, if you seek Ilm, then it is like you are in pursuit of the most precious object, so beware of what you are in pursuit of. So, if you are aware of this fact, then focus your heart on nothing but the pursuit of seeking Ilm.'",

"Page 14 - I ask Allah to accept this translation from me and to make it of great benefit to the reader; indeed, He is able to do all things. Taalib Tyson Jordan Amman July 2014 / Ramadaan 1435.",

"Page 15 - [CHAPTER] THE VIRTUES OF KNOWLEDGE WHICH IS LEARNT AND TAUGHT FOR THE SAKE OF ALLAH Allah the Exalted says in the Quran: 'And say: My Lord! Increase me in knowledge.' (Taha, 114) Allah the Exalted also says: 'Are those who know equal to those who know not.' (Az-Zumar, 9) Allah the Exalted also says: 'Allah will raise in degree those of you who believe, and those who have been granted knowledge.' (Al-Mujaadilah, 11) Allah the Exalted also says: 'It is only those who have knowledge among His slaves that fear Allah.' (Al-Faatir, 28).",

"Page 16 - [EXPLANATION OF CHAPTER HEADING AND SUPPORTING VERSES] The author Imam An-Nawawi mentions in this chapter the virtues of knowledge which is learnt and taught for the sake of Allah the Exalted, and what the author intends by the term 'Ilm' (knowledge) is knowledge of the Quran and the Sunnah of the Prophet, its virtue and the reward obtained by seeking it and exalting the possessors of it, who are the inheritors of the Prophets. And 'Ilm' is connected to Islamic law, namely the Aqeedah (the fundamental beliefs of Islam and rejection of false concepts), and how to implement it. And what is not intended by the meaning of knowledge here, is knowledge regarding worldly matters like accounting or engineering and the likes. So what is meant by Ilm like we said, is what pertains to the correct Islamic fundamentals and concepts, this is the Ilm we mean as Allah the Exalted rewards the seeker for obtaining such Ilm (knowledge), practicing and propagating it. So, Ilm which is sought is a type of striving (jihad), a striving in the way of Allah! With it, the foundations and struggling in Allah’s way are built. Because without Ilm, it is impossible for one to implement what is required of him in the correct way, so due to this Allah the Exalted says in the Quran:",

"Page 17 - 'And it is not (proper) for the believers to go out to fight (Jihaad) all together. Of every troop of them, a party only should go forth, that they (who are left behind) may get instructions in (Islamic) religion, and that they may warn their people when they return to them, so that they may beware (of evil).' (At-Tawbah, 122) So what is meant here is: not every individual should participate in jihad, rather one group should go forth and one group remain behind, that group remaining behind are those seeking Islamic knowledge, so that when the group that has gone forth to fight return, those who remained behind seeking Ilm can warn, advise or consult them upon their return. So Allah the Exalted put both groups on the same footing! And what we mean is, that those who remained behind seeking Ilm are equivalent to those who went out in the way of Allah; remaining behind seeking Ilm was equal to actually fighting jihad on the battlefield. Seeking Ilm precedes jihad and is greater! Why? The reason is, it is not possible for a fighter to fight, a person to pray, a person to pay zakat, to fast, to perform Hajj or Umrah, eat and drink or sleep or wake up except that he does so based upon Ilm.'",
  ]
}
