{
  "title": "Knowledge, Righteouness and Good Manners",
  "pages": [
    "Page 1 - Author's Biography in Breif, His Lineage, His name is Yahya Ibn Sharfuddeen Muree Ibn Hassan Al-Hizaammee Al-Huraanee, he was also known as Abu Zakariyyah; however he did not have a son named Zakariyyah as he did not marry. He Was given the nickname Muhyee-ud Deen (Reviver of the Religion); never the less he used to despise this title, and disliked being called that out of humbleness to Allah. One of the reasons why he disliked it was becasue Allah's religion is continuous and need of no one but Allah to keep it alive and established. It has been said that Imam An-Nawawai once said 'I shall not forgive the one who gives me this title Muhyee-ud Deen(Reviver of the Religion).' In another report it is stated that he",
    "Page 2 - 'It is impermissible for someone to nickname me Muhyee ul-Deen.' His Place of Birth: He was born in Nawa, the capital of Julaan, in the land of Huraan, in the year 631H in the month of Muharram. It is said that he was given the name Al-Nawawi by virtue of his place of birth, Nawa, and his place of residence was Damascus, Syria. His Early Life: He memorized the Quran before puberty, abandoning distractions and play. His burning thirst for knowledge could not be quenched in Nawa, so his father took him, at the age of 19, to seek knowledge in Damascus, where he enrolled at the school of Rawaahiyyah in the year 649H. During this time, in just four and a half months, he memorized the book At-Tanbeeh authored by Abu Ishaaq Al-Sheeraazee. In addition, he memorized a quarter of Al-Ibaadaat from the book Al-Muhadhab Fee Furoo during the remainder of that year. He would study 12 lessons a day, revising them on his way to classes and on his way home. It was said that not a moment of his life was wasted, except in the pursuit of Ilm (knowledge).His Later Life:He taught in many institutes, including Al-Madrasah Al-Iqbaaliyah, Al-Fulkeeyah, and Rukuneeyah. He was also appointed as a senior instructor in the institute Daarul Hadith Al-...",
  
  ]
}
